chalupec/nRF9160_Examples/mqtt_working/src/main.c
/*
 * TODO
 * 
 * - rozliseni pomoci define na ruzne jednotky and topics NRF/01/UP_STREAM
 * - jak ukoncit mereni rms check? skrz detekci prujezdu? ale spis skrz napeti pulsy
 */

#include <stdint.h>
#include <stdio.h>
#include <ncs_version.h>
#include <zephyr/kernel.h>
#include <zephyr/net/socket.h>
#include <poll.h>
#include <zephyr/types.h>

#include <zephyr/logging/log.h>
#include <dk_buttons_and_leds.h>
#include <modem/nrf_modem_lib.h>
#include <modem/lte_lc.h>
/* STEP 2.3 - Include the header file for the MQTT Library*/
#include <zephyr/net/mqtt.h>

#include "mqtt_connection.h"

#include <zephyr/drivers/adc.h>
#include <hal/nrf_saadc.h>
#include <nrfx_timer.h>


#include <date_time.h>

#include <nrfx_spim.h>
#include "../include/drivers/APS6404L.h"



#include <zephyr/sys/reboot.h>
#include <math.h>
//#include <clock.h>

#include <sys/_types.h>


#define SPIM_INST_IDX 1
#define MOSI_PIN 4
#define MISO_PIN 1
#define SCK_PIN 5
#define MEM_CS_PIN 0



// #define SAMPLE_PRINTING_ENABLED
// #define CIRC_BUFF_STAMP_VALUE_ADD

#define ALPHA_NUM 1	 // Numerator of alpha (e.g., 1)
#define ALPHA_DEN 25 // Denominator of alpha (e.g., 10) → alpha = 0.1

#define RMS_TRIG_TRESHOLD 500

#define RMS_BUFFER_SIZE 100

#define NR_OF_SAMPLES_TO_MEASURE 13500

#define RES_VAR_LEN 15000

#define WAVE_SAMPLE_LEN 1024   // MUST BE SAME AS CRCLR_BUFF_SIZE

#define CRCLR_BUFF_SIZE 1024	// MUST BE SAME AS WAVE_SAMPLE_LEN


#define FLASH_BYTE_READ_OUT_LEN 32   // POZOR OMEZENI VE FCI FLASH READ v driver knihovne, na max 32

/** @brief Symbol specifying time in milliseconds to wait for handler execution. */
#define TIME_TO_WAIT_US 500UL

#define DAQ_TIME_US 40

#define ADC_NODE DT_IO_CHANNELS_CTLR(DT_PATH(zephyr_user))

#define CHANNEL_0 0
#define CHANNEL_1 1
#define CHANNEL_2 2
#define CHANNEL_3 3
#define CHANNEL_4 4

#define BUFFER_WIDTH 4
#define BUFFER_LENGTH 4

// nt buffer[BUFFER_SIZE] = {0};
// int index = 0;

/** @brief Symbol specifying timer instance to be used. */
#define TIMER_INST_IDX 0

uint8_t jumpto_measurement_start_enabled=0;
uint8_t mqtt_trigger_reset=0;


int32_t rms_value[4] = {0};

int32_t buffer_rms_ch0[RMS_BUFFER_SIZE] = {0};
int32_t buffer_rms_ch1[RMS_BUFFER_SIZE] = {0};
int32_t buffer_rms_ch2[RMS_BUFFER_SIZE] = {0};
int32_t buffer_rms_ch3[RMS_BUFFER_SIZE] = {0};

int32_t ch0_off_value;
int32_t ch1_off_value;
int32_t ch2_off_value;
int32_t ch3_off_value;

size_t indexx = 0;
int64_t sum_squares_ch0 = 0;
int64_t sum_squares_ch1 = 0;
int64_t sum_squares_ch2 = 0;
int64_t sum_squares_ch3 = 0;
volatile uint16_t last_circ_buff_record = 0;

uint32_t record_unix_time_s;






int16_t buffer[BUFFER_LENGTH][BUFFER_WIDTH] = {0};
volatile uint8_t index = 0;

/* The mqtt client struct */
static struct mqtt_client client;
/* File descriptor */
static struct pollfd fds;

static K_SEM_DEFINE(lte_connected, 0, 1);

struct __attribute__((__packed__)) data_packet_t
{
	uint16_t packet_header;
	uint16_t packet_version;
	uint16_t actual_packet_nr;
	uint16_t total_packet_nr;
	uint32_t timestamp;
	uint32_t total_sample_count;
	uint16_t train_counter;

	int16_t chan_0_vlt[WAVE_SAMPLE_LEN];
	int16_t chan_0_int[WAVE_SAMPLE_LEN];
	int16_t chan_1_vlt[WAVE_SAMPLE_LEN];
	int16_t chan_1_int[WAVE_SAMPLE_LEN];

	uint16_t CRC;
};

struct __attribute__((__packed__)) servis_packet_t
{
	uint16_t packet_header;
	uint16_t packet_version;
	uint16_t reserve_word;
	uint16_t packet_counter;
	uint16_t batt_voltage;
	int16_t unit_temperature;
	uint32_t IMEI;
	uint32_t DEV_ID;
	uint16_t train_counter;
	uint16_t pwr_cycle_counter;
	uint32_t uptime_minutes;
	uint32_t last_powercycle_timestamp;
	uint16_t unit_status_bits;
	uint8_t signal_stength;
	uint16_t modem_status_word;
	float GPS_lat;
	float GPS_lon;
	float GPS_alt;
	uint16_t CRC;
};

static struct data_packet_t seed_packet;
uint16_t train_counter = 0;

static const struct device *adc_dev = DEVICE_DT_GET(ADC_NODE);

static const nrfx_timer_t timer = NRFX_TIMER_INSTANCE(0);

nrfx_spim_t spim_inst = NRFX_SPIM_INSTANCE(SPIM_INST_IDX);

volatile uint8_t ADC_SAMPLE_FLAG = 0;

int16_t sample_buffer[4];

uint16_t rec_counter = 0;

int16_t ch0_volt[RES_VAR_LEN];
int16_t ch1_volt[RES_VAR_LEN];
int16_t ch0_int[RES_VAR_LEN];
int16_t ch1_int[RES_VAR_LEN];
int32_t total_recorded_samples = 0;

int16_t circ_buff_ch0[CRCLR_BUFF_SIZE] = {0};
int16_t circ_buff_ch1[CRCLR_BUFF_SIZE] = {0};
int16_t circ_buff_ch2[CRCLR_BUFF_SIZE] = {0};
int16_t circ_buff_ch3[CRCLR_BUFF_SIZE] = {0};
uint16_t buff_head = 0;
uint8_t circ_buff_overflow = 0;

uint32_t flash_address_write=0;
uint32_t flash_address_read=0;
uint8_t flash_write_buffer_byte[FLASH_BYTE_READ_OUT_LEN + 32];
uint8_t flash_read_buffer_byte[FLASH_BYTE_READ_OUT_LEN + 32];



static const struct adc_sequence sequence = {
	.channels = BIT(CHANNEL_1) | BIT(CHANNEL_2) | BIT(CHANNEL_3) | BIT(CHANNEL_4),
	.buffer = sample_buffer,
	.buffer_size = sizeof(sample_buffer),
	.resolution = 14
	//.oversampling = NRF_SAADC_OVERSAMPLE_16X
};

static const struct adc_channel_cfg channel_cfg_0 = {
	.gain = ADC_GAIN_1_6,
	.reference = ADC_REF_INTERNAL,
	.acquisition_time = ADC_ACQ_TIME(ADC_ACQ_TIME_MICROSECONDS, DAQ_TIME_US),
	.channel_id = CHANNEL_0,
	.input_positive = NRF_SAADC_INPUT_AIN0};

static const struct adc_channel_cfg channel_cfg_1 = {
	.gain = ADC_GAIN_1_6,
	.reference = ADC_REF_INTERNAL,
	.acquisition_time = ADC_ACQ_TIME(ADC_ACQ_TIME_MICROSECONDS, DAQ_TIME_US),
	.channel_id = CHANNEL_1,
	.input_positive = NRF_SAADC_INPUT_AIN1};

static const struct adc_channel_cfg channel_cfg_2 = {
	.gain = ADC_GAIN_1_6,
	.reference = ADC_REF_INTERNAL,
	.acquisition_time = ADC_ACQ_TIME(ADC_ACQ_TIME_MICROSECONDS, DAQ_TIME_US),
	.channel_id = CHANNEL_2,
	.input_positive = NRF_SAADC_INPUT_AIN2};

static const struct adc_channel_cfg channel_cfg_3 = {
	.gain = ADC_GAIN_1_6,
	.reference = ADC_REF_INTERNAL,
	.acquisition_time = ADC_ACQ_TIME(ADC_ACQ_TIME_MICROSECONDS, DAQ_TIME_US),
	.channel_id = CHANNEL_3,
	.input_positive = NRF_SAADC_INPUT_AIN3};

static const struct adc_channel_cfg channel_cfg_4 = {
	.gain = ADC_GAIN_1_6,
	.reference = ADC_REF_INTERNAL,
	.acquisition_time = ADC_ACQ_TIME(ADC_ACQ_TIME_MICROSECONDS, DAQ_TIME_US),
	.channel_id = CHANNEL_4,
	.input_positive = NRF_SAADC_INPUT_AIN4};

