chalupec/nRF9160_Examples/mqtt_working/src/main.c
				fl_buff_bcnt=0;
				while (fl_buff_bcnt<FLASH_BYTE_READ_OUT_LEN) {
					seed_packet.chan_0_vlt[samples_to_load_cntr]=flash_read_buffer_byte[fl_buff_bcnt++]<<8;
					seed_packet.chan_0_vlt[samples_to_load_cntr]|=flash_read_buffer_byte[fl_buff_bcnt++];

					seed_packet.chan_0_int[samples_to_load_cntr]=flash_read_buffer_byte[fl_buff_bcnt++]<<8;
					seed_packet.chan_0_int[samples_to_load_cntr]|=flash_read_buffer_byte[fl_buff_bcnt++];

					seed_packet.chan_1_vlt[samples_to_load_cntr]=flash_read_buffer_byte[fl_buff_bcnt++]<<8;
					seed_packet.chan_1_vlt[samples_to_load_cntr]|=flash_read_buffer_byte[fl_buff_bcnt++];

					seed_packet.chan_1_int[samples_to_load_cntr]=flash_read_buffer_byte[fl_buff_bcnt++]<<8;
					seed_packet.chan_1_int[samples_to_load_cntr]|=flash_read_buffer_byte[fl_buff_bcnt++];
					samples_to_load_cntr++;
				}
			}
		}

		uint16_t sizestruct = sizeof(seed_packet);
		//LOG_INF("size of struct is: %d", sizestruct);
		uint8_t *byte_ptr = (uint8_t *)&seed_packet;

		int err = 0;
		//	err = data_publish(&client, MQTT_QOS_1_AT_LEAST_ONCE,
		//						   byte_ptr, sizestruct);
		err = data_publish(&client, MQTT_QOS_0_AT_MOST_ONCE,
						   byte_ptr, sizestruct);
		if (err)
		{
			LOG_INF("Failed to send message, %d", err);
			return;
		}
	}
	train_counter++;
}



static void button_handler(uint32_t button_state, uint32_t has_changed)
{
	switch (has_changed)
	{
	case DK_BTN1_MSK:

		if (button_state & DK_BTN1_MSK)
		{
			seed_packet.packet_header = 0xBEEF;
			seed_packet.packet_version = 0x0101;
			seed_packet.actual_packet_nr = 0x0001;
			seed_packet.total_packet_nr = 0x0001;

			seed_packet.timestamp = 1748277406;
			seed_packet.train_counter = train_counter;
			train_counter++;
			seed_packet.CRC = 0xABCD;

			/*memcpy(seed_packet.chan_0_vlt, chan_dat, 64);
			memcpy(seed_packet.chan_1_vlt, chan_dat, 16);
			memcpy(&seed_packet.chan_0_int[5], chan_dat_128, 128);
			memcpy(seed_packet.chan_1_int, &chan_dat_128[10], 50);
*/
			uint16_t sizestruct = sizeof(seed_packet);
			LOG_INF("size of struct is: %d", sizestruct);
			uint8_t *byte_ptr = (uint8_t *)&seed_packet;

			k_sleep(K_MSEC(100));
			LOG_INF("step: %d", 4);
			k_sleep(K_MSEC(100));
			int err = data_publish(&client, MQTT_QOS_1_AT_LEAST_ONCE,
								   byte_ptr, sizestruct);
			if (err)
			{
				LOG_INF("Failed to send message, %d", err);
				return;
			}
		}
		break;

	case DK_BTN2_MSK:
		if (button_state & DK_BTN2_MSK)
		{
			send_multiple_packets(5);
		}
		break;

	default:
		break;
	}
}

void add_samples_to_buffer(int16_t samples[BUFFER_WIDTH], int16_t buffer[BUFFER_LENGTH][BUFFER_WIDTH])
{
	for (int i = 0; i < BUFFER_WIDTH; i++)
	{
		buffer[index][i] = samples[i];
	}
	index++;
	if (index == BUFFER_LENGTH)
	{
		index = 0;
	}
}

void print_4buffer(int16_t buffer[BUFFER_LENGTH][BUFFER_WIDTH])
{
	for (int i = 0; i < BUFFER_LENGTH; i++)
	{
		for (int j = 0; j < BUFFER_WIDTH; j++)
		{
			printf("%d,", buffer[i][j]);
		}
		printf("\n");
	}
}

void average_of_vectors(int16_t array[BUFFER_LENGTH][BUFFER_WIDTH], int16_t averages[BUFFER_WIDTH])
{
	for (int i = 0; i < BUFFER_WIDTH; i++)
	{
		int32_t total_sum = 0;
		for (int j = 0; j < BUFFER_LENGTH; j++)
		{
			total_sum += array[j][i];
		}
		averages[i] = (int16_t)(total_sum / BUFFER_LENGTH);
	}
}

int32_t exponential_filter(int32_t previous_filtered, int32_t new_sample)
{
	return (ALPHA_NUM * new_sample + (ALPHA_DEN - ALPHA_NUM) * previous_filtered) / ALPHA_DEN;
}

int32_t update_rms(int32_t *buffer, size_t *indexx, int64_t *sum_squares, int32_t new_sample)
{
	// Remove the oldest sample's square from the sum
	int32_t old_sample = buffer[*indexx];
	*sum_squares -= (int64_t)old_sample * old_sample;

	// Add the new sample's square to the sum
	buffer[*indexx] = new_sample;
	*sum_squares += (int64_t)new_sample * new_sample;

	// Update index
	*indexx = (*indexx + 1) % RMS_BUFFER_SIZE;

	// Calculate RMS
	int32_t mean_square = *sum_squares / RMS_BUFFER_SIZE;
	return (int32_t)sqrt((double)mean_square);
}


void circular_buffer_init(void) {
	buff_head = 0;
	circ_buff_overflow = 1;
	clear_buffer(circ_buff_ch0, CRCLR_BUFF_SIZE);
	clear_buffer(circ_buff_ch1, CRCLR_BUFF_SIZE);
	clear_buffer(circ_buff_ch2, CRCLR_BUFF_SIZE);
	clear_buffer(circ_buff_ch3, CRCLR_BUFF_SIZE);
	}

uint16_t circular_buffer_add_value(int16_t value0, int16_t value1, int16_t value2, int16_t value3)
{
	if (buff_head < CRCLR_BUFF_SIZE)
	{
		circ_buff_ch0[buff_head] = value0;
		circ_buff_ch1[buff_head] = value1;
		circ_buff_ch2[buff_head] = value2;
		circ_buff_ch3[buff_head] = value3;
		buff_head++;
	}
	else
	{
		buff_head = 0;
		circ_buff_overflow = 1;
		circ_buff_ch0[buff_head] = value0;
		circ_buff_ch1[buff_head] = value1;
		circ_buff_ch2[buff_head] = value2;
		circ_buff_ch3[buff_head] = value3;
		buff_head++;
	}
	return (buff_head);
}

// Clears a buffer of int16_t values
void clear_buffer(int16_t *buffer, size_t length)
{
	memset(buffer, 0, length * sizeof(int16_t));
}

void saturate_channel_values(void)
{
	if (ch0_off_value > 32750)
	{
		ch0_off_value = 32750;
	}
	if (ch0_off_value < -32750)
	{
		ch0_off_value = -32750;
	}

	if (ch1_off_value > 32750)
	{
		ch1_off_value = 32750;
	}
	if (ch1_off_value < -32750)
	{
		ch1_off_value = -32750;
	}

	if (ch2_off_value > 32750)
	{
		ch2_off_value = 32750;
	}
	if (ch2_off_value < -32750)
	{
		ch2_off_value = -32750;
	}

	if (ch3_off_value > 32750)
	{
		ch3_off_value = 32750;
	}
	if (ch3_off_value < -32750)
	{
		ch3_off_value = -32750;
	}
}




void get_time_procedure(void)
{
    int err = date_time_update_async(NULL);
    if (err) {
        printk("date_time_update_async error: %d\n", err);
    }

    struct tm timeinfo;
    int64_t unix_time_ms;

    if (date_time_now(&unix_time_ms)) {
        printk("Failed to get time\n");
        return;
    }

    time_t unix_time_s = unix_time_ms / 1000;

	record_unix_time_s=unix_time_ms / 1000;


    gmtime_r(&unix_time_s, &timeinfo);

    printk("Current UTC time: %s", asctime(&timeinfo));
}



int main(void)
{
	int err;

	uint32_t connect_attempt = 0;

	uint32_t record_cnt = 1780;

