chalupec/nRF9160_Examples/mqtt_working/src/main.c
		if ((rms_value[0] > RMS_TRIG_TRESHOLD) || (rms_value[2] > RMS_TRIG_TRESHOLD))
		{
			LOG_INF("treshold crossed");
			uint16_t sample_cntr = 0;

			if (circ_buff_overflow == 1)
			{
				sample_cntr = CRCLR_BUFF_SIZE;
			}
			else
			{

				sample_cntr = last_circ_buff_record;
			}

			total_recorded_samples = sample_cntr;


			flash_address_write=0;


			while (1)
			{

				if (ADC_SAMPLE_FLAG == 1)
				{

					// gpio_pin_set_dt(&led0, 1);
					ADC_SAMPLE_FLAG = 0;
					adc_read(adc_dev, &sequence);				   // takes 248 us
					add_samples_to_buffer(sample_buffer, &buffer); // takes 2 us
					average_of_vectors(buffer, &sample_buffer2);   // 3.5 us

					new_sample = sample_buffer2[0] - offsets[0]; // Replace with actual sensor/ADC reading
					ch0_off_value = new_sample;
					rms_value[0] = update_rms(buffer_rms_ch0, &indexx, &sum_squares_ch0, new_sample);

					new_sample = sample_buffer2[1] - offsets[1]; // Replace with actual sensor/ADC reading
					ch1_off_value = new_sample;
					rms_value[1] = update_rms(buffer_rms_ch1, &indexx, &sum_squares_ch1, new_sample);

					new_sample = sample_buffer2[2] - offsets[2]; // Replace with actual sensor/ADC reading
					ch2_off_value = new_sample;
					rms_value[2] = update_rms(buffer_rms_ch2, &indexx, &sum_squares_ch2, new_sample);

					new_sample = sample_buffer2[3] - offsets[3]; // Replace with actual sensor/ADC reading
					ch3_off_value = new_sample;
					rms_value[3] = update_rms(buffer_rms_ch3, &indexx, &sum_squares_ch3, new_sample);

					saturate_channel_values();

					flash_write_buffer_byte[0]=ch0_off_value>>8;
					flash_write_buffer_byte[1]=ch0_off_value&0xff;

					flash_write_buffer_byte[2]=ch1_off_value>>8;
					flash_write_buffer_byte[3]=ch1_off_value&0xff;

					flash_write_buffer_byte[4]=ch2_off_value>>8;
					flash_write_buffer_byte[5]=ch2_off_value&0xff;

					flash_write_buffer_byte[6]=ch3_off_value>>8;
					flash_write_buffer_byte[7]=ch3_off_value&0xff;

					flash_write_buffer_byte[6]=rms_value[0]>>8;   // FIXME ONLY FOR OBSERVING RMS
					flash_write_buffer_byte[7]=rms_value[0]&0xff; // FIXME ONLY FOR OBSERVING RMS
		
					FLASH_MEMORY_WRITE_BYTE_ARRAY(flash_address_write, flash_write_buffer_byte, 8);  // cca 20-40 us?
					flash_address_write+=8;


					sample_cntr++;
					total_recorded_samples++;

					if (sample_cntr > NR_OF_SAMPLES_TO_MEASURE)
					{
						break;
					}
				}
			}

			uint16_t loc_circ_buf_cntr = 0;
			uint16_t mcnt = 0;
			uint16_t samples_to_store_from_circ_buff = 0;

			if (circ_buff_overflow == 1)
			{
				samples_to_store_from_circ_buff = CRCLR_BUFF_SIZE;
				loc_circ_buf_cntr = last_circ_buff_record;
			}
			else
			{
				samples_to_store_from_circ_buff = last_circ_buff_record;
				loc_circ_buf_cntr = 0;
			}

			while (mcnt < samples_to_store_from_circ_buff)
			{
				if (loc_circ_buf_cntr < CRCLR_BUFF_SIZE)
				{
					ch0_volt[mcnt] = circ_buff_ch0[loc_circ_buf_cntr];
					ch0_int[mcnt] = circ_buff_ch1[loc_circ_buf_cntr];
					ch1_volt[mcnt] = circ_buff_ch2[loc_circ_buf_cntr];
					ch1_int[mcnt] = circ_buff_ch3[loc_circ_buf_cntr];
					loc_circ_buf_cntr++;
					mcnt++;
				}
				else
				{
					loc_circ_buf_cntr = 0;
				}
			}
#ifdef CIRC_BUFF_STAMP_VALUE_ADD
			ch0_volt[samples_to_store_from_circ_buff] = ch0_volt[samples_to_store_from_circ_buff] + 5000;
			ch0_int[samples_to_store_from_circ_buff] = ch0_int[samples_to_store_from_circ_buff] + 5000;
			ch1_volt[samples_to_store_from_circ_buff] = ch1_volt[samples_to_store_from_circ_buff] + 5000;
			ch1_int[samples_to_store_from_circ_buff] = ch1_int[samples_to_store_from_circ_buff] + 5000;
#endif

			data_ready_to_send = 1;
		//	clear_buffer(circ_buff_ch0, CRCLR_BUFF_SIZE);
		//	clear_buffer(circ_buff_ch1, CRCLR_BUFF_SIZE);
		//	clear_buffer(circ_buff_ch2, CRCLR_BUFF_SIZE);
		//clear_buffer(circ_buff_ch3, CRCLR_BUFF_SIZE);

			if (0)
			{
				uint16_t prntcnt = 0;
				while (prntcnt < 2500)
				{
					if (1)
					{
						printk("%d, %d, %d, %d\n",
							   ch0_volt[prntcnt],
							   ch0_int[prntcnt],
							   ch1_volt[prntcnt],
							   ch1_int[prntcnt]);
					}
					else
					{
						printk("%d, %d, %d, %d\n",
							   ch0_volt[prntcnt],
							   0,
							   0,
							   0);
					}
					k_sleep(K_USEC(1000));
					prntcnt++;
				}
			}

			while (0)
			{
				// FIXME
			}
		}

		if (data_ready_to_send == 1)
		{
			break;
		}
	}

if (jumpto_measurement_start_enabled==0) {	
	err = modem_configure();
	if (err)
	{
		LOG_ERR("Failed to configure the modem");
		return 0;
	}

	if (dk_buttons_init(button_handler) != 0)
	{
		LOG_ERR("Failed to initialize the buttons library");
	}

	err = client_init(&client);
	if (err)
	{
		LOG_ERR("Failed to initialize MQTT client: %d", err);
		return 0;
	}

do_connect:
	if (connect_attempt++ > 0)
	{
		LOG_INF("Reconnecting in %d seconds...",
				CONFIG_MQTT_RECONNECT_DELAY_S);
		k_sleep(K_SECONDS(CONFIG_MQTT_RECONNECT_DELAY_S));
	}

	err = mqtt_connect(&client);
	if (err)
	{
		LOG_ERR("Error in mqtt_connect: %d", err);
		goto do_connect;
	}

	err = fds_init(&client, &fds);
	if (err)
	{
		LOG_ERR("Error in fds_init: %d", err);
		return 0;
	}


}else {
	jumpto_measurement_start_enabled=0;
}

	rec_counter = 0;
	while (1)
	{

		err = poll(&fds, 1, mqtt_keepalive_time_left(&client));
		if (err < 0)
		{
			LOG_ERR("Error in poll(): %d", errno);
			break;
		}

		err = mqtt_live(&client);
		if ((err != 0) && (err != -EAGAIN))
		{
			LOG_ERR("Error in mqtt_live: %d", err);
			break;
		}

		if ((fds.revents & POLLIN) == POLLIN)
		{
			err = mqtt_input(&client);
			if (err != 0)
			{
				LOG_ERR("Error in mqtt_input: %d", err);
				break;
			}
		}

		if ((fds.revents & POLLERR) == POLLERR)
		{
			LOG_ERR("POLLERR");
			break;
		}

		if ((fds.revents & POLLNVAL) == POLLNVAL)
		{
			LOG_ERR("POLLNVAL");
			break;
		}

		if (data_ready_to_send == 1)
		{
			data_ready_to_send = 0;
			printk("pause\n");




			k_sleep(K_MSEC(2000));

			//send_measured_train_data_with_multiple_packets_from_flash
			//clock_gettime(CLOCK_REALTIME, &timer_record);
			//timer_record->tv
			get_time_procedure();


			 LOG_INF("timestamp gathered from modem %" PRIu32,record_unix_time_s);
			//send_measured_train_data_with_multiple_packets();
			send_measured_train_data_with_multiple_packets_from_flash();
		}


		if (mqtt_trigger_reset==1) {
			mqtt_trigger_reset=0;
			LOG_INF("trigger reset in progress\n");
			k_sleep(K_MSEC(1000));
			LOG_INF("endup mqtt client connection\n");
			int8_t errrno;
						errrno = mqtt_disconnect(&client);
			if (errrno) {
				LOG_ERR("Could not disconnect: %d", errrno);
			}
			k_sleep(K_MSEC(1000));

			LOG_INF("LTE_LC_FUNC_MODE_OFFLINE\n");
			lte_lc_func_mode_set(LTE_LC_FUNC_MODE_OFFLINE);
			k_sleep(K_MSEC(1000));
			LOG_INF("nrf_modem_lib_shutdown\n");
			nrf_modem_lib_shutdown();
			k_sleep(K_MSEC(2000));
			sys_reboot(SYS_REBOOT_COLD);
		}


		if (jumpto_measurement_start_enabled==1) {
			
			goto do_measurement;

